; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v7 ?v8)
             (pred_4 ?v11 ?v13)
             (pred_9 ?v7 ?v13)
             (pred_6 ?v5 ?v7 )
	     (pred_5 ?v7)
             (pred_8 ?v4)
             (pred_1 ?v11)
             (pred_12 ?v13)
             (pred_11 ?v7)
             (pred_10 ?v11)
             (pred_3 ?v7)
             (pred_2 ))



(:action op_2
:parameters (?v9 ?v6 ?v2 ?v10)
:precondition (and (pred_8 ?v9) (pred_8 ?v6) (pred_1 ?v2) (pred_12 ?v10)
          (pred_7 ?v9 ?v6) (pred_4 ?v2 ?v10)
                   (pred_9 ?v6 ?v10) (pred_5 ?v9) 
                   (pred_11 ?v6) (pred_10 ?v2))
:effect (and  (pred_3 ?v6) (not (pred_11 ?v6))))


(:action op_1
:parameters (?v9 ?v1)
:precondition (and (pred_8 ?v9) (pred_8 ?v1)
               (pred_5 ?v9) (pred_7 ?v9 ?v1) (pred_3 ?v1))
:effect (and (pred_5 ?v1) (not (pred_5 ?v9))))

(:action op_4
:parameters (?v9 ?v2)
:precondition (and (pred_8 ?v9) (pred_1 ?v2) 
                  (pred_5 ?v9) (pred_6 ?v2 ?v9) (pred_2 ))
:effect (and (pred_10 ?v2)
   (not (pred_6 ?v2 ?v9)) (not (pred_2 ))))


(:action op_5
:parameters (?v9 ?v12 ?v3)
:precondition (and (pred_8 ?v9) (pred_1 ?v12) (pred_1 ?v3)
                  (pred_5 ?v9) (pred_10 ?v3) (pred_6 ?v12 ?v9))
:effect (and (pred_10 ?v12) (pred_6 ?v3 ?v9)
        (not (pred_10 ?v3)) (not (pred_6 ?v12 ?v9))))

(:action op_3
:parameters (?v9 ?v2)
:precondition (and (pred_8 ?v9) (pred_1 ?v2) 
                  (pred_5 ?v9) (pred_10 ?v2))
:effect (and (pred_2 ) (pred_6 ?v2 ?v9) (not (pred_10 ?v2)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_07 obj_02 obj_03 obj_15 obj_11 obj_06 obj_10 obj_14 obj_13 obj_16 obj_21 obj_08 obj_04 obj_19 obj_01
    obj_12 obj_05
    obj_17 obj_20 obj_09
    )

    (:init
       (pred_2)

       (pred_8 obj_18)
       (pred_8 obj_07)
       (pred_8 obj_02)
       (pred_8 obj_03)
       (pred_8 obj_15)
       (pred_8 obj_11)
       (pred_8 obj_06)
       (pred_8 obj_10)
       (pred_8 obj_14)
       (pred_8 obj_13)
       (pred_8 obj_16)
       (pred_8 obj_21)
       (pred_8 obj_08)
       (pred_8 obj_04)
       (pred_8 obj_19)
       (pred_8 obj_01)
       (pred_12 obj_12)
       (pred_12 obj_05)
       (pred_1 obj_17)
       (pred_1 obj_20)
       (pred_1 obj_09)

       (pred_7 obj_18 obj_15)
       (pred_7 obj_18 obj_07)
       (pred_7 obj_07 obj_11)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_07 obj_18)
       (pred_7 obj_02 obj_06)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_15 obj_11)
       (pred_7 obj_15 obj_18)
       (pred_7 obj_11 obj_13)
       (pred_7 obj_11 obj_06)
       (pred_7 obj_11 obj_07)
       (pred_7 obj_11 obj_15)
       (pred_7 obj_06 obj_16)
       (pred_7 obj_06 obj_10)
       (pred_7 obj_06 obj_02)
       (pred_7 obj_06 obj_11)
       (pred_7 obj_10 obj_21)
       (pred_7 obj_10 obj_03)
       (pred_7 obj_10 obj_06)
       (pred_7 obj_14 obj_08)
       (pred_7 obj_14 obj_13)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_13 obj_04)
       (pred_7 obj_13 obj_16)
       (pred_7 obj_13 obj_11)
       (pred_7 obj_13 obj_14)
       (pred_7 obj_16 obj_19)
       (pred_7 obj_16 obj_21)
       (pred_7 obj_16 obj_06)
       (pred_7 obj_16 obj_13)
       (pred_7 obj_21 obj_01)
       (pred_7 obj_21 obj_10)
       (pred_7 obj_21 obj_16)
       (pred_7 obj_08 obj_04)
       (pred_7 obj_08 obj_14)
       (pred_7 obj_04 obj_19)
       (pred_7 obj_04 obj_13)
       (pred_7 obj_04 obj_08)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_19 obj_16)
       (pred_7 obj_19 obj_04)
       (pred_7 obj_01 obj_21)
       (pred_7 obj_01 obj_19)
       (pred_11 obj_01)
       (pred_11 obj_21)
       (pred_11 obj_13)
       (pred_9  obj_01 obj_12)
       (pred_9  obj_21 obj_05)
       (pred_9  obj_13 obj_05)
       (pred_3 obj_18)
       (pred_3 obj_07)
       (pred_3 obj_02)
       (pred_3 obj_03)
       (pred_3 obj_15)
       (pred_3 obj_11)
       (pred_3 obj_06)
       (pred_3 obj_10)
       (pred_3 obj_14)
       (pred_3 obj_16)
       (pred_3 obj_08)
       (pred_3 obj_04)
       (pred_3 obj_19)

       (pred_4  obj_17 obj_12)
       (pred_4  obj_20 obj_05)
       (pred_4  obj_09 obj_05)
       (pred_6 obj_17 obj_06)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_09 obj_04)
       (pred_5 obj_11)
    )

    (:goal (and
       (pred_6 obj_17 obj_03)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_09 obj_16)
    ))
(:constraints
  (always (not (pred_5 obj_19)))
)
)

; plan
1. (op_4 obj_11 obj_20)
   deleted: (pred_6 obj_20 obj_11) (pred_2)
   added: (pred_10 obj_20)
   goals met: 0 of 3
2. (op_1 obj_11 obj_06)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_06)
   goals met: 0 of 3
3. (op_5 obj_06 obj_17 obj_20)
   deleted: (pred_10 obj_20) (pred_6 obj_17 obj_06)
   added: (pred_10 obj_17) (pred_6 obj_20 obj_06)
   goals met: 0 of 3
4. (op_1 obj_06 obj_16)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_16)
   goals met: 0 of 3
5. (op_3 obj_16 obj_17)
   deleted: (pred_10 obj_17)
   added: (pred_2) (pred_6 obj_17 obj_16)
   goals met: 0 of 3
6. (op_1 obj_16 obj_06)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_06)
   goals met: 0 of 3
7. (op_4 obj_06 obj_20)
   deleted: (pred_6 obj_20 obj_06) (pred_2)
   added: (pred_10 obj_20)
   goals met: 0 of 3
8. (op_1 obj_06 obj_02)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_02)
   goals met: 0 of 3
9. (op_1 obj_02 obj_07)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_07)
   goals met: 0 of 3
10. (op_1 obj_07 obj_11)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_11)
   goals met: 0 of 3
11. (op_2 obj_11 obj_13 obj_20 obj_05)
   deleted: (pred_11 obj_13)
   added: (pred_3 obj_13)
   goals met: 0 of 3
12. (op_1 obj_11 obj_13)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_13)
   goals met: 0 of 3
13. (op_1 obj_13 obj_04)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_04)
   goals met: 0 of 3
14. (op_5 obj_04 obj_09 obj_20)
   deleted: (pred_10 obj_20) (pred_6 obj_09 obj_04)
   added: (pred_10 obj_09) (pred_6 obj_20 obj_04)
   goals met: 0 of 3
15. (op_1 obj_04 obj_13)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_13)
   goals met: 0 of 3
16. (op_1 obj_13 obj_16)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_16)
   goals met: 0 of 3
17. (op_5 obj_16 obj_17 obj_09)
   deleted: (pred_10 obj_09) (pred_6 obj_17 obj_16)
   added: (pred_10 obj_17) (pred_6 obj_09 obj_16)
   goals met: 1 of 3
18. (op_1 obj_16 obj_13)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_13)
   goals met: 1 of 3
19. (op_1 obj_13 obj_11)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_11)
   goals met: 1 of 3
20. (op_3 obj_11 obj_17)
   deleted: (pred_10 obj_17)
   added: (pred_2) (pred_6 obj_17 obj_11)
   goals met: 1 of 3
21. (op_1 obj_11 obj_13)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_13)
   goals met: 1 of 3
22. (op_1 obj_13 obj_04)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_04)
   goals met: 1 of 3
23. (op_4 obj_04 obj_20)
   deleted: (pred_6 obj_20 obj_04) (pred_2)
   added: (pred_10 obj_20)
   goals met: 1 of 3
24. (op_1 obj_04 obj_13)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_13)
   goals met: 1 of 3
25. (op_1 obj_13 obj_11)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_11)
   goals met: 1 of 3
26. (op_1 obj_11 obj_07)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_07)
   goals met: 1 of 3
27. (op_3 obj_07 obj_20)
   deleted: (pred_10 obj_20)
   added: (pred_2) (pred_6 obj_20 obj_07)
   goals met: 2 of 3
28. (op_1 obj_07 obj_11)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_11)
   goals met: 2 of 3
29. (op_4 obj_11 obj_17)
   deleted: (pred_6 obj_17 obj_11) (pred_2)
   added: (pred_10 obj_17)
   goals met: 2 of 3
30. (op_1 obj_11 obj_07)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_07)
   goals met: 2 of 3
31. (op_1 obj_07 obj_02)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_02)
   goals met: 2 of 3
32. (op_1 obj_02 obj_03)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_03)
   goals met: 2 of 3
33. (op_3 obj_03 obj_17)
   deleted: (pred_10 obj_17)
   added: (pred_2) (pred_6 obj_17 obj_03)
   goals met: 3 of 3
